{
  "featEyebrow": "Design AI Tools",
  "featTitle": "This is a feature title",
  "featDescription": "This is a feature description",
  "btnroute": "doc/13",
  "label": "Feature Label",
  "entries": [
    {
      "id": 1,
      "title": "The Shifting Landscape of Design",
      "description": "The design industry is in a state of flux. The landscape is shifting, and the role of the designer is evolving. The days of the designer as a pixel pusher are long gone. The designer of today is a strategic thinker, a problem solver, and a storyteller. The designer of today is a leader, a collaborator, and a change agent. The designer of today is a business person, a technologist, and a futurist.",
      "eyebrow": "Design Evolution AI",
      "route": "/doc/13",
      "thumbnail": "article/cover1.png",
      "alt": "Article: The Shifting Landscape of Design"
    },
    {
      "id": 2,
      "title": "Baselines & Design QA: Setting the Foundation for Quality",
      "eyebrow": "Quality Process",
      "description": "How early baselines make Design QA effortless. When you set design baselines before implementation begins, you prevent problems from taking root. The result? Less testing needed later, fewer discrepancies to catch, and a shared understanding of what 'done' looks like.",
      "route": "/doc/1",
      "thumbnail": "article/cover2.png",
      "alt": "Article: Baselines & Design QA"
    },

    
    {
      "id": 7,
      "title": "The Value of Writing",
      "eyebrow": "Musing",
      "description": "What am I trying to say? Do I even have a point?",
      "route": "/doc/27",
      "thumbnail": "article/jacques.jpg",
      "alt": "Article: Writing for Non-Writers"
    },
    {
      "id": 8,
      "title": "Building My Portfolio: A Design System Playground",
      "eyebrow": "Case Study Design Systems",
      "description": "A living portfolio site that serves as both a showcase and a design system playground. Features a fully-styled markdown renderer, token-based theming with user mode switching, variable font typography, reusable components, and an AI chatbot trained on site content.",
      "route": "/doc/36",
      "thumbnail": "gennifer.png",
      "alt": "Portfolio Site: Design System Playground"
    },
    {
      "id": 9,
      "title": "Designing Genie: Pioneering UX Patterns for Agentic AI",
      "eyebrow": "Agentic AI Design",
      "description": "An agentic orchestration layer for delivery operations that connects to project ecosystems and continuously synthesizes context, surfaces insights, and automates workflows. Explores three mental model problems in designing for agentic AI: capability exposition, trust & transparency, and autonomy vs. control.",
      "route": "/doc/32",
      "thumbnail": "casestudy/genie/genie.png",
      "alt": "Genie - Agentic AI Platform"
    }
  ]
}
