[
  {
    "title": "Experience",
    "entries": [
      {
        "title": "Senior Product Designer & Design Lead",
        "position": "",
        "location": "Orium (formerly Myplanet)",
        "from": "2013",
        "to": "Present",
        "description": "Senior Product Designer and design lead working at the intersection of design systems, code, and AI. Over more than a decade at Orium, I’ve helped scale design across enterprise clients by architecting design systems, pairing closely with engineering, and driving design quality from concept through implementation. Recent focus includes leading UX for Genie, an agentic AI/AX platform, and strengthening design–dev integration so the things we design are the things we actually ship.",
        "callout": "Senior Product Designer & Design Lead focusing on design systems, Genie (AI/AX), and design–dev integration across enterprise products."
      },
      {
        "title": "Mindfulness Facilitator",
        "position": "",
        "location": "Orium",
        "from": "2016",
        "to": "Present",
        "description": "At Orium, I have played a pivotal role in championing mindfulness as a driving force for personal growth and the overall evolution of the company. For the past 5 years, I have been an instrumental Mindfulness Facilitator, creating a nurturing environment where individuals can learn, develop, and thrive.<br> As a passionate advocate for mindfulness, I am one of the key day-to-day ambassadors promoting a positive and harmonious atmosphere within our multi-disciplinary teams. Through fostering emotional intelligence and encouraging a sense of well-being, I have contributed to a culture that values good vibes and nurtures a deeper connection among team members. <br> By continuously supporting and encouraging mindful breaks, I have helped empower individuals to achieve their best selves, both personally and professionally. My dedication to mindfulness aligns seamlessly with Orium's vision, enhancing productivity, well-being, and overall success within the organization.",
        "callout": "I'm one of many day-to-day mindfulness ambassadors promoting good-vibes and fostering emotional intelligence on multi-disciplinary teams."
      },
      {
        "title": "UX Designer",
        "position": "",
        "location": "University Health Network",
        "from": "",
        "to": "Summer 2013",
        "description": "UX Designer contributing to healthcare digital products in a complex, regulated environment, supporting patient- and clinician-facing experiences."
      },
      {
        "title": "UI Designer",
        "position": "",
        "location": "Orium",
        "from": "Jan 2013",
        "to": "April 2013",
        "description": "<p><strong>THIS IS HTML - need to fix ol style!!!</strong> During my tenure as a UI Designer (Fellow) at Orium, I embarked on a transformative learning experience for students, recent graduates, and career changers. Collaborated with aspiring student designers to craft product pitches and interfaces, gaining real-world expertise in UI design. Honed user-centric design skills and embraced team collaboration, setting a solid foundation for future growth.</p><ul><li>Unique learning opportunity for students, recent graduates, and career changers.</li><li>Collaborated with aspiring student designers on product pitches and interfaces.</li><li>Real-world experience in UI design and team collaboration.</li><li>Emphasized user-centric design principles.</li><li>Fostered creativity and collaboration.</li><li>Honed skills in ideation, iteration, and UI design.</li><li>Contributed to nurturing the next generation of design talent.</li></ul>"
      },
      {
        "title": "Print Shop Rep",
        "position": "",
        "location": "Staples",
        "from": "Nov 2010",
        "to": "Dec 2012",
        "description": "Print production and customer-facing role supporting small business and personal print work while studying design."
      },
      {
        "title": "Graphic Designer",
        "position": "",
        "location": "Bethel Group",
        "from": "Sep 2008",
        "to": "Jul 2010",
        "description": "Graphic Designer working on visual communication and layout projects early in my career."
      },
      {
        "title": "Design Intern",
        "position": "",
        "location": "Media Enterprises Ltd.",
        "from": "Mar 2008",
        "to": "Aug 2008",
        "description": "Design internship focused on hands-on production, typography, and learning the day-to-day realities of commercial design."
      }
    ]
  },

  {
    "title": "Education",
    "entries": [
      {
        "title": "Graphic Design",
        "location": "OCADU (Ontario College of Art & Design University)",
        "from": "2010",
        "to": "2014",
        "description": "Bachelor-level Graphic Design program with a focus on digital design, typography, and emerging media."
      }
    ]
  },

  {
    "title": "Skills",
    "entries": [
      "Design Systems · Design Tokens · Component Architecture",
      "Product Design · UX Design · Interaction Design",
      "Front-end Development (React, Vue, CSS/SCSS)",
      "AI/AX Design (Genie, agentic experiences)",
      "Design–Dev Integration · Design QA · Storybook",
      "Leadership · Mentorship · Mindfulness Facilitation"
    ]
  },

  {
    "title": "Projects",
    "entries": [
      "K&G Loyalty Platform – Lead product design and front-end implementation for a mobile loyalty experience (React Native + partner platforms).",
      "OnLogic Composable Commerce – Product and systems design for a configurable commerce experience serving technical users at scale.",
      "Genie AI/AX Platform – Design lead for agentic AI experiences, defining UX patterns for how teams collaborate with AI agents."
    ]
  }
]
